In [ ]:
import pandas as pd

In [3]:
df_pro = pd.read_csv('data/교수.csv')
df_pro

   교수번호 교수이름 교수학과       임용일 교수직급       급여
0   221  이병렬   전산  75/04/03  정교수  3000000
1   228  이재광   전산  91/09/19  부교수  2500000
2   311  강승일   전자  94/06/09  부교수  2300000
3   509  오문환   건축  92/10/14  조교수  2000000

In [79]:
df_pro['교수이름']

0    이병렬
1    이재광
2    강승일
3    오문환
Name: 교수이름, dtype: object

In [7]:
df_pro[['교수이름', '교수직급']]

  교수이름 교수직급
0  이병렬  정교수
1  이재광  부교수
2  강승일  부교수
3  오문환  조교수

In [9]:
df_pro[:3]

   교수번호 교수이름 교수학과       임용일 교수직급       급여
0   221  이병렬   전산  75/04/03  정교수  3000000
1   228  이재광   전산  91/09/19  부교수  2500000
2   311  강승일   전자  94/06/09  부교수  2300000

In [11]:
df_pro.head(3)

   교수번호 교수이름 교수학과       임용일 교수직급       급여
0   221  이병렬   전산  75/04/03  정교수  3000000
1   228  이재광   전산  91/09/19  부교수  2500000
2   311  강승일   전자  94/06/09  부교수  2300000

In [13]:
df_pro.tail(2)

   교수번호 교수이름 교수학과       임용일 교수직급       급여
2   311  강승일   전자  94/06/09  부교수  2300000
3   509  오문환   건축  92/10/14  조교수  2000000

In [14]:
df_pro[1:3]

   교수번호 교수이름 교수학과       임용일 교수직급       급여
1   228  이재광   전산  91/09/19  부교수  2500000
2   311  강승일   전자  94/06/09  부교수  2300000

In [15]:
df_pro[['교수이름', '임용일']][1:3]

  교수이름       임용일
1  이재광  91/09/19
2  강승일  94/06/09

In [21]:
df_pro.loc[1:3]

   교수번호 교수이름 교수학과       임용일 교수직급       급여
1   228  이재광   전산  91/09/19  부교수  2500000
2   311  강승일   전자  94/06/09  부교수  2300000
3   509  오문환   건축  92/10/14  조교수  2000000

In [22]:
df_pro.loc[1:2, ['교수이름', '임용일']]

  교수이름       임용일
1  이재광  91/09/19
2  강승일  94/06/09

In [23]:
df_pro.loc[0:2, '교수이름':'급여']

  교수이름 교수학과       임용일 교수직급       급여
0  이병렬   전산  75/04/03  정교수  3000000
1  이재광   전산  91/09/19  부교수  2500000
2  강승일   전자  94/06/09  부교수  2300000

In [25]:
df_pro.columns

Index(['교수번호', '교수이름', '교수학과', '임용일', '교수직급', '급여'], dtype='object')

In [26]:
df_index_pcode = df_pro.set_index('교수번호')
df_index_pcode

     교수이름 교수학과       임용일 교수직급       급여
교수번호
221   이병렬   전산  75/04/03  정교수  3000000
228   이재광   전산  91/09/19  부교수  2500000
311   강승일   전자  94/06/09  부교수  2300000
509   오문환   건축  92/10/14  조교수  2000000

In [61]:
df_index_pcode.loc[221, '교수이름']

'이병렬'

In [59]:
df_index_pcode['교수이름'][221]

'이병렬'

In [67]:
df_index_pcode.loc[200:300, '교수이름']

교수번호
221    이병렬
228    이재광
Name: 교수이름, dtype: object

In [69]:
df_index_pcode['교수이름'][[221, 228]]

교수번호
221    이병렬
228    이재광
Name: 교수이름, dtype: object

In [70]:
df_index_pcode.loc[:, ['교수이름', '교수학과']]

     교수이름 교수학과
교수번호
221   이병렬   전산
228   이재광   전산
311   강승일   전자
509   오문환   건축

In [78]:
df_index_pcode.loc[300:, '교수이름':'교수직급']

     교수이름 교수학과       임용일 교수직급
교수번호
311   강승일   전자  94/06/09  부교수
509   오문환   건축  92/10/14  조교수

In [89]:
df_pro['교수이름'][2]

'강승일'

In [94]:
df_pro[['교수이름', '교수학과']].tail(2)

  교수이름 교수학과
2  강승일   전자
3  오문환   건축

In [96]:
df_index_pcode.loc[:300, '교수이름':'임용일']

     교수이름 교수학과       임용일
교수번호
221   이병렬   전산  75/04/03
228   이재광   전산  91/09/19

In [103]:
df_index_pcode

     교수이름 교수학과       임용일 교수직급       급여
교수번호
221   이병렬   전산  75/04/03  정교수  3000000
228   이재광   전산  91/09/19  부교수  2500000
311   강승일   전자  94/06/09  부교수  2300000
509   오문환   건축  92/10/14  조교수  2000000

In [102]:
df_index_pcode.iloc[0, 0]

'이병렬'

In [106]:
df_pro.iloc[0,0]

np.int64(221)

In [107]:
df_pro

   교수번호 교수이름 교수학과       임용일 교수직급       급여
0   221  이병렬   전산  75/04/03  정교수  3000000
1   228  이재광   전산  91/09/19  부교수  2500000
2   311  강승일   전자  94/06/09  부교수  2300000
3   509  오문환   건축  92/10/14  조교수  2000000

In [111]:
df_pro.iloc[0:2, 0:3]

   교수번호 교수이름 교수학과
0   221  이병렬   전산
1   228  이재광   전산

In [113]:
df_pro.iloc[3, :]

교수번호         509
교수이름         오문환
교수학과          건축
임용일     92/10/14
교수직급         조교수
급여       2000000
Name: 3, dtype: object

In [115]:
df_pro.iloc[:, 1]

0    이병렬
1    이재광
2    강승일
3    오문환
Name: 교수이름, dtype: object

In [119]:
df_pro.iloc[[1,3], [0,1]]

   교수번호 교수이름
1   228  이재광
3   509  오문환

In [126]:
cols=df_pro.columns
cols[-1].index

In [127]:
df_pro.iloc[3]

교수번호         509
교수이름         오문환
교수학과          건축
임용일     92/10/14
교수직급         조교수
급여       2000000
Name: 3, dtype: object

In [130]:
df_pro.iloc[::3, :]

   교수번호 교수이름 교수학과       임용일 교수직급       급여
0   221  이병렬   전산  75/04/03  정교수  3000000
3   509  오문환   건축  92/10/14  조교수  2000000

In [131]:
df_pro.iloc[:, ::2]

   교수번호 교수학과 교수직급
0   221   전산  정교수
1   228   전산  부교수
2   311   전자  부교수
3   509   건축  조교수

In [132]:
df_pro.iloc[:, -1]

0    3000000
1    2500000
2    2300000
3    2000000
Name: 급여, dtype: int64

In [133]:
df_pro.loc[:, '급여']

0    3000000
1    2500000
2    2300000
3    2000000
Name: 급여, dtype: int64

In [135]:
df_pro.iloc[-1, :]

교수번호         509
교수이름         오문환
교수학과          건축
임용일     92/10/14
교수직급         조교수
급여       2000000
Name: 3, dtype: object

In [137]:
df_pro.loc[3, :]

교수번호         509
교수이름         오문환
교수학과          건축
임용일     92/10/14
교수직급         조교수
급여       2000000
Name: 3, dtype: object

In [138]:
df_pro

   교수번호 교수이름 교수학과       임용일 교수직급       급여
0   221  이병렬   전산  75/04/03  정교수  3000000
1   228  이재광   전산  91/09/19  부교수  2500000
2   311  강승일   전자  94/06/09  부교수  2300000
3   509  오문환   건축  92/10/14  조교수  2000000

In [142]:
filt=df_pro['급여'] >= 2500000
df_pro[filt]

   교수번호 교수이름 교수학과       임용일 교수직급       급여
0   221  이병렬   전산  75/04/03  정교수  3000000
1   228  이재광   전산  91/09/19  부교수  2500000

In [144]:
df_pro[~filt]

   교수번호 교수이름 교수학과       임용일 교수직급       급여
2   311  강승일   전자  94/06/09  부교수  2300000
3   509  오문환   건축  92/10/14  조교수  2000000

In [145]:
df_pro[df_pro['급여'] >= 2500000]

   교수번호 교수이름 교수학과       임용일 교수직급       급여
0   221  이병렬   전산  75/04/03  정교수  3000000
1   228  이재광   전산  91/09/19  부교수  2500000

In [146]:
df_pro.loc[filt, ['교수이름', '급여']]

  교수이름       급여
0  이병렬  3000000
1  이재광  2500000

In [147]:
df_pro

   교수번호 교수이름 교수학과       임용일 교수직급       급여
0   221  이병렬   전산  75/04/03  정교수  3000000
1   228  이재광   전산  91/09/19  부교수  2500000
2   311  강승일   전자  94/06/09  부교수  2300000
3   509  오문환   건축  92/10/14  조교수  2000000

In [154]:
filt=(df_pro['교수학과']=='전산') & (df_pro['교수직급']=='부교수')
df_pro[filt]

   교수번호 교수이름 교수학과       임용일 교수직급       급여
1   228  이재광   전산  91/09/19  부교수  2500000

In [155]:
filt=(df_pro['교수학과'] == '전산') | (df_pro['교수학과'] == '전자')
df_pro[filt]

   교수번호 교수이름 교수학과       임용일 교수직급       급여
0   221  이병렬   전산  75/04/03  정교수  3000000
1   228  이재광   전산  91/09/19  부교수  2500000
2   311  강승일   전자  94/06/09  부교수  2300000

In [158]:
df_pro.loc[filt, ['교수번호', '교수학과']]

   교수번호 교수학과
0   221   전산
1   228   전산
2   311   전자

In [157]:
df_pro[['교수번호','교수학과']][filt]

   교수번호 교수학과
0   221   전산
1   228   전산
2   311   전자

In [159]:
df_pro

   교수번호 교수이름 교수학과       임용일 교수직급       급여
0   221  이병렬   전산  75/04/03  정교수  3000000
1   228  이재광   전산  91/09/19  부교수  2500000
2   311  강승일   전자  94/06/09  부교수  2300000
3   509  오문환   건축  92/10/14  조교수  2000000

In [162]:
filt=df_pro['교수이름'].str.startswith('이')
df_pro[filt]

   교수번호 교수이름 교수학과       임용일 교수직급       급여
0   221  이병렬   전산  75/04/03  정교수  3000000
1   228  이재광   전산  91/09/19  부교수  2500000

In [166]:
filt = df_pro['교수이름'].str.contains('승')
df_pro[filt]

   교수번호 교수이름 교수학과       임용일 교수직급       급여
2   311  강승일   전자  94/06/09  부교수  2300000

In [168]:
title=['조교수', '부교수']
filt = df_pro['교수직급'].isin(title)
df_pro[filt]

   교수번호 교수이름 교수학과       임용일 교수직급       급여
1   228  이재광   전산  91/09/19  부교수  2500000
2   311  강승일   전자  94/06/09  부교수  2300000
3   509  오문환   건축  92/10/14  조교수  2000000